In [11]:
import pandas as pd

data_path = '../data/VL_csv/tn_travel_여행_E_COST.csv'

df = pd.read_csv(data_path)
print(df.shape)

df.head(3).T

(2560, 14)

,0,1,2
TRAVEL_ID,e_e000004,e_e000006,e_e000009
TRAVEL_NM,E03,E03,E03
TRAVELER_ID,e000004,e000006,e000009
TRAVEL_PURPOSE,3,21,2;4
TRAVEL_START_YMD,2023-04-30,2023-04-30,2023-04-29
TRAVEL_END_YMD,2023-05-01,2023-05-02,2023-05-01
MVMN_NM,NaN,NaN,NaN
TRAVEL_PERSONA,서울 외 수도권 방문/수도권 거주/40세 이상/자녀동반/일반미션,경기 방문/거주지 구분 없음/39세 이하/특별미션,서울 외 수도권 방문/수도권 거주/39세 이하/커플/일반미션
TRAVEL_MISSION,3,21,2;4
TRAVEL_MISSION_CHECK,3;4;11,21;10;27,22;1;7
PRE_COST,9500,0,0
LODGOUT_COST,9500,0,0
ACTIVITY_COST,0,58500,319340
TOTAL_COST,19000,58500,319340

# 특별미션, 일반미션 구분확인

In [22]:
df[df['TRAVEL_PERSONA'].str.contains('일반미션', na=False) & df['TRAVEL_PERSONA'].str.contains('거주지 구분 없음', na=False)]

Empty DataFrame
Columns: [TRAVEL_ID, TRAVEL_NM, TRAVELER_ID, TRAVEL_PURPOSE, TRAVEL_START_YMD, TRAVEL_END_YMD, MVMN_NM, TRAVEL_PERSONA, TRAVEL_MISSION, TRAVEL_MISSION_CHECK, PRE_COST, LODGOUT_COST, ACTIVITY_COST, TOTAL_COST]
Index: []

In [16]:
df[df['TRAVEL_PERSONA'].str.contains('특별미션', na=False) & ~df['TRAVEL_PERSONA'].str.contains('거주지 구분 없음', na=False)]

Empty DataFrame
Columns: [TRAVEL_ID, TRAVEL_NM, TRAVELER_ID, TRAVEL_PURPOSE, TRAVEL_START_YMD, TRAVEL_END_YMD, MVMN_NM, TRAVEL_PERSONA, TRAVEL_MISSION, TRAVEL_MISSION_CHECK, PRE_COST, LODGOUT_COST, ACTIVITY_COST, TOTAL_COST]
Index: []

- 일반미션, 특별미션은 거주지 단위로 구분이 가능함

In [28]:
df[df['TRAVEL_PERSONA'].str.contains('일반미션', na=False)]['TRAVEL_PURPOSE'].str.split(';').apply(lambda x: list(map(int, x)))

0                      [3]
2                   [2, 4]
3                   [3, 6]
4                  [1, 21]
5           [1, 22, 24, 6]
               ...
2554                   [4]
2555    [12, 23, 26, 3, 9]
2556                [4, 9]
2557                   [1]
2559     [10, 2, 24, 5, 6]
Name: TRAVEL_PURPOSE, Length: 1897, dtype: object

In [29]:
df[df['TRAVEL_PERSONA'].str.contains('특별미션', na=False)]['TRAVEL_PURPOSE'].str.split(';').apply(lambda x: list(map(int, x)))

1                        [21]
10                   [28, 21]
11                       [24]
12                   [22, 25]
14                       [22]
                ...
2540    [22, 26, 24, 1, 4, 6]
2548                 [10, 28]
2549              [2, 21, 26]
2552         [2, 24, 4, 5, 9]
2558                     [22]
Name: TRAVEL_PURPOSE, Length: 663, dtype: object